app/views/dashboard/weekly.html.erb

SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."source_type" = $2 AND "todo_items"."source_id" = $3 AND "todo_items"."week_start_date" = $4 AND "todo_items"."completed" = $5  [["user_id", 1], ["source_type", "Goal"], ["source_id", 1], ["week_start_date", "2025-09-01"], ["completed", true]]
---
                          completion = goal.completion_for_week(@current_week_start)
                          completed_count = current_user.todo_items.where(source: goal, week_start_date: @current_week_start, completed: true).count