app/views/dashboard/weekly.html.erb

SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."source_type" = $2 AND "todo_items"."source_id" = $3 AND "todo_items"."week_start_date" = $4 AND "todo_items"."completed" = $5  [["user_id", 1], ["source_type", "Goal"], ["source_id", 1], ["week_start_date", "2025-09-01"], ["completed", true]]
---
                          completion = goal.completion_for_week(@current_week_start)
                          completed_count = current_user.todo_items.where(source: goal, week_start_date: @current_week_start, completed: true).count

SELECT "notes".* FROM "notes" WHERE "notes"."notable_type" = $1 AND "notes"."notable_id" = $2  [["notable_type", "TodoItem"], ["notable_id", 89]]
---
function initializeNoteModalHandlers() {
  document.querySelectorAll('.add-notes-btn, .view-notes-btn').forEach(function(button) {
    if (button.dataset.noteModalInitialized === 'true') return;

    button.dataset.noteModalInitialized = 'true';

    button.addEventListener('click', function() {
      const todoId = this.getAttribute('data-todo-id');
      const existingNotes = this.getAttribute('data-notes') || '';

      const notableTypeField = document.getElementById('note_notable_type');
      const notableIdField = document.getElementById('note_notable_id');
      const noteIdField = document.getElementById('note_id');
      const textarea = document.querySelector('#noteForm textarea[name="note[content]"]');

      if (notableTypeField) notableTypeField.value = 'TodoItem';
      if (notableIdField) notableIdField.value = todoId || '';
      if (noteIdField) noteIdField.value = '';
      if (textarea) textarea.value = existingNotes;
    });
  });