app/controllers/ad_hoc_todos_controller.rb

INSERT INTO "ad_hoc_todos" ("description", "user_id", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "a sdfasd asd dfs m"], ["user_id", 1], ["completed", false], ["created_at", "2025-09-02 16:35:57.648660"], ["updated_at", "2025-09-02 16:35:57.648660"]]
INSERT INTO "todo_items" ("description", "user_id", "source_type", "source_id", "completed", "created_at", "updated_at", "week_start_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @ad_hoc_todo = current_user.ad_hoc_todos.build(ad_hoc_todo_params)

    # Check if description ends with " m" to mark as meeting
    is_meeting = @ad_hoc_todo.description.end_with?(" m")

    # Get week/year from params or use current week
    year = params[:year]&.to_i || params.dig(:ad_hoc_todo, :year)&.to_i || Date.current.year
    week = params[:week]&.to_i || params.dig(:ad_hoc_todo, :week)&.to_i || Date.current.cweek
    week_start_date = Date.commercial(year, week, 1)

    if @ad_hoc_todo.save
      # Create a todo item for this ad hoc todo
      # If it's marked as a meeting, remove the " m" suffix from the description
      description = is_meeting ? @ad_hoc_todo.description.chomp(" m") : @ad_hoc_todo.description

      current_user.todo_items.create!(
        description: description,
        source: @ad_hoc_todo,
        week_start_date: week_start_date
      )

DELETE FROM "ad_hoc_todos" WHERE "ad_hoc_todos"."id" = $1  [["id", 1]]
---
  def destroy
    @ad_hoc_todo.destroy

SELECT "ad_hoc_todos".* FROM "ad_hoc_todos" WHERE "ad_hoc_todos"."user_id" = $1 AND "ad_hoc_todos"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_ad_hoc_todo
    @ad_hoc_todo = current_user.ad_hoc_todos.find(params[:id])