app/controllers/dashboard_controller.rb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."week_start_date" = $2 AND (source_type = 'RecurringMeeting' OR (source_type = 'AdHocTodo' AND source_id IN (2))) ORDER BY "todo_items"."completed" ASC, "todo_items"."created_at" ASC  [["user_id", 1], ["week_start_date", "2025-09-01"]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."completed" = ? AND "todo_items"."created_at" BETWEEN ? AND ? ORDER BY "todo_items"."created_at" ASC  [["user_id", 1], ["completed", 0], ["created_at", "2025-09-01 00:00:00"], ["created_at", "2025-09-07 23:59:59.999999"]]
SELECT 1 AS one FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."completed" = ? AND "todo_items"."created_at" BETWEEN ? AND ? LIMIT ?  [["user_id", 1], ["completed", 0], ["created_at", "2025-09-01 00:00:00"], ["created_at", "2025-09-07 23:59:59.999999"], ["LIMIT", 1]]
---
  def weekly
    @selected_year = params[:year]&.to_i || Date.current.year
    @selected_week = params[:week]&.to_i || Date.current.cweek

    # Calculate the start and end of the selected week
    @current_week_start = Date.commercial(@selected_year, @selected_week, 1)
    @current_week_end = Date.commercial(@selected_year, @selected_week, 7)

    # Get all todo items for the selected week, ordered by completion status then creation date
    @todo_items = current_user.todo_items
                              .where(week_start_date: @current_week_start)
                              .includes(:notes)
                              .order(:completed, :created_at)

    # Check if todos have been generated for this week
    @todos_generated = @todo_items.any?

DELETE FROM "todo_items" WHERE "todo_items"."id" = $1  [["id", 23]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."week_start_date" = $2  [["user_id", 1], ["week_start_date", "2025-09-08"]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."week_start_date" = $2  [["user_id", 1], ["week_start_date", "2025-09-01"]]
UPDATE "goal_completions" SET "completed_count" = $1 WHERE "goal_completions"."goal_id" = $2 AND "goal_completions"."completed_count" != $3  [["completed_count", 0], ["goal_id", 1], ["completed_count", 0]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 1]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."week_start_date" = ?  [["user_id", 1], ["week_start_date", "2025-09-01"]]
---
  def clear_todos
    year = params[:year].to_i
    week = params[:week].to_i
    week_start_date = Date.commercial(year, week, 1)

    # Delete all todo items for this week
    current_user.todo_items.where(week_start_date: week_start_date).destroy_all

    # Reset goal completion statistics for this week
    current_user.goals.each do |goal|
      completion = goal.completion_for_week(week_start_date)
      completion.update(completed_count: 0)
    end

    # Also clear any old goal completion records that might have non-zero counts
    # This ensures the Goals page shows accurate statistics
    current_user.goals.each do |goal|
      goal.goal_completions.where.not(completed_count: 0).update_all(completed_count: 0)

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."week_start_date" = ? ORDER BY "todo_items"."created_at" ASC  [["user_id", 1], ["week_start_date", "2025-09-01"]]
SELECT "recurring_meetings".* FROM "recurring_meetings" WHERE "recurring_meetings"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."source_type" = ? AND "todo_items"."source_id" = ? AND "todo_items"."week_start_date" = ? LIMIT ?  [["user_id", 1], ["source_type", "RecurringMeeting"], ["source_id", 1], ["week_start_date", "2025-09-01"], ["LIMIT", 1]]
SELECT "goals".* FROM "goals" WHERE "goals"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def weekly_report
    @selected_year = params[:year]&.to_i || Date.current.year
    @selected_week = params[:week]&.to_i || Date.current.cweek

    # Calculate the start and end of the selected week
    @current_week_start = Date.commercial(@selected_year, @selected_week, 1)
    @current_week_end = Date.commercial(@selected_year, @selected_week, 7)

    # Get all todo items for the selected week
    @all_todo_items = current_user.todo_items
                                 .where(week_start_date: @current_week_start)
                                 .includes(:notes) # Removed :source from includes
                                 .order(:created_at)

    @completed_items = @all_todo_items.completed
    @incomplete_items = [] # Empty array - we don't want incomplete items in the report

    @meeting_items = @all_todo_items.completed.where(source_type: 'RecurringMeeting')
    @goal_items = @all_todo_items.completed.where(source_type: 'Goal')

SELECT "recurring_meetings".* FROM "recurring_meetings" WHERE "recurring_meetings"."user_id" = ?  [["user_id", 1]]
INSERT INTO "todo_items" ("description", "user_id", "source_type", "source_id", "completed", "created_at", "updated_at", "week_start_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."active" = $2  [["user_id", 1], ["active", true]]
INSERT INTO "todo_items" ("description", "user_id", "source_type", "source_id", "completed", "created_at", "updated_at", "week_start_date") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def generate_weekly_todos_for_date(week_start_date)
    todos_created = 0

    # Generate todos from recurring meetings
    current_user.recurring_meetings.each do |meeting|
      if meeting.should_occur_in_week?(week_start_date)
        current_user.todo_items.create!(
          description: meeting.name,
          source: meeting,
          week_start_date: week_start_date
        )
        todos_created += 1
      end
    end

    # Generate todos from active goals
    current_user.goals.active.each do |goal| # Only active goals
      goal.target_count.times do
        current_user.todo_items.create!(
          description: goal.description,
          source: goal,
          week_start_date: week_start_date
        )