app/controllers/dashboard_controller.rb

  def generate_weekly_todos
    todos_created = 0

    # Generate meeting todos for the selected week
    current_user.recurring_meetings.each do |meeting|
      if meeting_occurs_in_week?(meeting, @current_week_start)
        # Check if we already have a todo item for this meeting this week
        existing_todo = current_user.todo_items.find_by(
          source_type: 'RecurringMeeting',
          source_id: meeting.id,
          week_start_date: @current_week_start
        )

        unless existing_todo
          current_user.todo_items.create!(
            description: "Meeting: #{meeting.name} with #{meeting.person}",
            source_type: 'RecurringMeeting',
            source_id: meeting.id,
            week_start_date: @current_week_start
          )
          todos_created += 1
        end
      end
    end

    # Generate goal todos for the selected week
    current_user.goals.each do |goal|
      # Check how many todo items we already have for this goal this week
      existing_count = current_user.todo_items.where(
        source_type: 'Goal',
        source_id: goal.id,
        week_start_date: @current_week_start
      ).count
---
SELECT "recurring_meetings".* FROM "recurring_meetings" WHERE "recurring_meetings"."user_id" = ?  [["user_id", 1]]
INSERT INTO "todo_items" ("description", "user_id", "source_type", "source_id", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."source_type" = ? AND "todo_items"."source_id" = ? AND "todo_items"."week_start_date" = ?  [["user_id", 1], ["source_type", "Goal"], ["source_id", 1], ["week_start_date", "2025-09-01"]]