app/controllers/dashboard_controller.rb

  def weekly
    # Get the selected week from params, default to current week
    @selected_year = params[:year]&.to_i || Date.current.year
    @selected_week = params[:week]&.to_i || Date.current.cweek

    # Calculate the start and end of the selected week
    @current_week_start = Date.commercial(@selected_year, @selected_week, 1)
    @current_week_end = Date.commercial(@selected_year, @selected_week, 7)

    # Get all todo items for the selected week (both completed and incomplete)
    @todo_items = current_user.todo_items
                           .where(week_start_date: @current_week_start)
                           .includes(:notes, :source)
                           .order(:created_at)

    # Check if todos have been generated for this week
    @todos_generated = @todo_items.exists?

    # For debugging - get counts of meetings and goals
    @meetings_count = current_user.recurring_meetings.count
    @goals_count = current_user.goals.count
---
SELECT "recurring_meetings".* FROM "recurring_meetings" WHERE "recurring_meetings"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
SELECT COUNT(*) FROM "recurring_meetings" WHERE "recurring_meetings"."user_id" = ?  [["user_id", 1]]
SELECT "goals".* FROM "goals" WHERE "goals"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = ?  [["user_id", 1]]

  def clear_todos
    @selected_year = params[:year]&.to_i || Date.current.year
    @selected_week = params[:week]&.to_i || Date.current.cweek

    # Calculate the start of the selected week
    @current_week_start = Date.commercial(@selected_year, @selected_week, 1)

    # Delete all todo items for the selected week
    todos_deleted = current_user.todo_items.where(week_start_date: @current_week_start).destroy_all.count
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]

  def generate_weekly_todos
    todos_created = 0

    # Generate meeting todos for the selected week
    current_user.recurring_meetings.each do |meeting|
      if meeting_occurs_in_week?(meeting, @current_week_start)
        # Check if we already have a todo item for this meeting this week
        existing_todo = current_user.todo_items.find_by(
          source_type: 'RecurringMeeting',
          source_id: meeting.id,
          week_start_date: @current_week_start
        )

        unless existing_todo
          current_user.todo_items.create!(
            description: "Meeting: #{meeting.name} with #{meeting.person}",
            source_type: 'RecurringMeeting',
            source_id: meeting.id,
            week_start_date: @current_week_start
          )
          todos_created += 1
        end
      end
    end

    # Generate goal todos for the selected week (only active goals)
    current_user.goals.active.each do |goal|
      # Check how many todo items we already have for this goal this week
      existing_count = current_user.todo_items.where(
        source_type: 'Goal',
        source_id: goal.id,
        week_start_date: @current_week_start
      ).count

      # Create additional todo items if needed
      (goal.target_count - existing_count).times do |index|
        current_user.todo_items.create!(
          description: "#{goal.description} (#{existing_count + index + 1} of #{goal.target_count})",
          source_type: 'Goal',
          source_id: goal.id,
          week_start_date: @current_week_start
        )
---
SELECT "recurring_meetings".* FROM "recurring_meetings" WHERE "recurring_meetings"."user_id" = $1  [["user_id", 1]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."source_type" = ? AND "todo_items"."source_id" = ? AND "todo_items"."week_start_date" = ? LIMIT ?  [["user_id", 1], ["source_type", "RecurringMeeting"], ["source_id", 1], ["week_start_date", "2025-09-01"], ["LIMIT", 1]]
INSERT INTO "todo_items" ("description", "user_id", "source_type", "source_id", "completed", "created_at", "updated_at", "week_start_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."active" = $2  [["user_id", 1], ["active", true]]
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."source_type" = ? AND "todo_items"."source_id" = ? AND "todo_items"."week_start_date" = ?  [["user_id", 1], ["source_type", "Goal"], ["source_id", 1], ["week_start_date", "2025-09-01"]]
INSERT INTO "todo_items" ("description", "user_id", "source_type", "source_id", "completed", "created_at", "updated_at", "week_start_date") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"