app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? ORDER BY "goals"."created_at" ASC  [["user_id", 1]]
---
  def index
    @goals = current_user.goals.ordered

SELECT "goal_completions".* FROM "goal_completions" WHERE "goal_completions"."goal_id" = ?  [["goal_id", 1]]
---
  def show
    @goal_completions = @goal.goal_completions.ordered

INSERT INTO "goals" ("description", "target_count", "user_id", "created_at", "updated_at", "active") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Add Qualified Investors to IM"], ["target_count", 5], ["user_id", 1], ["created_at", "2025-09-01 21:22:29.885535"], ["updated_at", "2025-09-01 21:22:29.885535"], ["active", true]]
---
  def create
    @goal = current_user.goals.build(goal_params)

    if @goal.save

UPDATE "goals" SET "updated_at" = ?, "active" = ? WHERE "goals"."id" = ?  [["updated_at", "2025-09-01 20:27:41.747814"], ["active", 0], ["id", 1]]
---
  def update
    if @goal.update(goal_params)

UPDATE "goals" SET "updated_at" = ?, "active" = ? WHERE "goals"."id" = ?  [["updated_at", "2025-09-01 20:44:08.447524"], ["active", 0], ["id", 1]]
---
  def toggle_active
    Rails.logger.info "Toggling goal #{@goal.id} from #{@goal.active} to #{!@goal.active}"

    if @goal.update(active: !@goal.active)

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? AND "goals"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_goal
    @goal = current_user.goals.find(params[:id])