app/controllers/goals_controller.rb

  def create
    @goal = current_user.goals.build(goal_params)

    if @goal.save
---
INSERT INTO "goals" ("description", "target_count", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["description", "Add Investors to IM"], ["target_count", 10], ["user_id", 1], ["created_at", "2025-09-01 18:56:33.554755"], ["updated_at", "2025-09-01 18:56:33.554755"]]

  def update
    if @goal.update(goal_params)
---
UPDATE "goals" SET "description" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["description", "Talk to Investor"], ["updated_at", "2025-09-01 18:57:14.544894"], ["id", 2]]

  def set_goal
    @goal = current_user.goals.find(params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? AND "goals"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]