app/controllers/notes_controller.rb

INSERT INTO "notes" ("content", "user_id", "notable_type", "notable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "sdfgsdg sdfg"], ["user_id", 1], ["notable_type", "TodoItem"], ["notable_id", 1], ["created_at", "2025-09-01 23:18:56.406158"], ["updated_at", "2025-09-01 23:18:56.406158"]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 89], ["LIMIT", 1]]
UPDATE "todo_items" SET "completed" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed", 1], ["updated_at", "2025-09-01 20:15:48.374510"], ["id", 92]]
---
  def create
    @note = current_user.notes.build(note_params)

    if @note.save
      # Check if we should also mark the item as complete
      if params[:action] == "add_notes_and_complete" && @note.notable_type == 'TodoItem'
        todo_item = current_user.todo_items.find(@note.notable_id)
        todo_item.update(completed: true)

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def update
    @note = current_user.notes.find(params[:id])

    if @note.update(note_params)
      # Check if we should also mark the item as complete
      if params[:action] == "add_notes_and_complete" && @note.notable_type == 'TodoItem'
        todo_item = current_user.todo_items.find(@note.notable_id)

UPDATE "goal_completions" SET "completed_count" = $1, "updated_at" = $2 WHERE "goal_completions"."id" = $3  [["completed_count", 1], ["updated_at", "2025-09-01 22:52:56.237354"], ["id", 4]]
---
  def track_goal_completion(goal, week_start_date)
    completion = goal.completion_for_week(week_start_date)

    # Count completed todo items for this goal in this week, including the current one
    completed_count = current_user.todo_items
                                 .where(source: goal, week_start_date: week_start_date, completed: true)
                                 .count

    # Update the completion record with the correct count
    completion.update(completed_count: completed_count)