app/controllers/recurring_meetings_controller.rb

  def create
    @recurring_meeting = current_user.recurring_meetings.build(recurring_meeting_params)

    if @recurring_meeting.save
---
INSERT INTO "recurring_meetings" ("name", "person", "frequency", "user_id", "created_at", "updated_at", "week_of_month", "month_of_quarter", "biweekly_pattern") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def set_recurring_meeting
    @recurring_meeting = current_user.recurring_meetings.find(params[:id])
---
SELECT "recurring_meetings".* FROM "recurring_meetings" WHERE "recurring_meetings"."user_id" = $1 AND "recurring_meetings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]