app/controllers/todo_items_controller.rb

  def update
    if @todo_item.update(todo_item_params)
---
UPDATE "todo_items" SET "completed" = $1, "updated_at" = $2 WHERE "todo_items"."id" = $3  [["completed", false], ["updated_at", "2025-09-01 22:57:11.273313"], ["id", 21]]

  def destroy
    @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = $1  [["id", 68]]

  def set_todo_item
    @todo_item = current_user.todo_items.find(params[:id])
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 68], ["LIMIT", 1]]

  def track_goal_completion(goal, week_start_date)
    completion = goal.completion_for_week(week_start_date)

    # Count completed todo items for this goal in this week
    completed_count = current_user.todo_items
                                 .where(source: goal, week_start_date: week_start_date, completed: true)
                                 .count

    completion.update(completed_count: completed_count)
---
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."source_type" = $2 AND "todo_items"."source_id" = $3 AND "todo_items"."week_start_date" = $4 AND "todo_items"."completed" = $5  [["user_id", 1], ["source_type", "Goal"], ["source_id", 1], ["week_start_date", "2025-09-08"], ["completed", true]]
UPDATE "goal_completions" SET "completed_count" = $1, "updated_at" = $2 WHERE "goal_completions"."id" = $3  [["completed_count", 1], ["updated_at", "2025-09-04 19:08:29.473698"], ["id", 16]]