app/controllers/todo_items_controller.rb

  def set_todo_item
    @todo_item = current_user.todo_items.find(params[:id])
---
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."user_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 89], ["LIMIT", 1]]

  def track_goal_completion(goal, week_start_date)
    completion = goal.completion_for_week(week_start_date)

    # Count completed todo items for this goal in this week, including the current one
    completed_count = current_user.todo_items
                                 .where(source: goal, week_start_date: week_start_date, completed: true)
                                 .count
---
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."user_id" = $1 AND "todo_items"."source_type" = $2 AND "todo_items"."source_id" = $3 AND "todo_items"."week_start_date" = $4 AND "todo_items"."completed" = $5  [["user_id", 1], ["source_type", "Goal"], ["source_id", 4], ["week_start_date", "2025-09-01"], ["completed", true]]