app/views/goals/index.html.erb

SELECT "goal_completions".* FROM "goal_completions" WHERE "goal_completions"."goal_id" IN ($1, $2, $3, $4, $5)  [["goal_id", 1], ["goal_id", 2], ["goal_id", 3], ["goal_id", 4], ["goal_id", 5]]
SELECT 1 AS one FROM "goal_completions" WHERE "goal_completions"."goal_id" = ? LIMIT ?  [["goal_id", 1], ["LIMIT", 1]]
---
                  <!-- Progress Summary -->
                  <% if goal.goal_completions.any? %>

SELECT 1 AS one FROM "goal_completions" WHERE "goal_completions"."goal_id" = ? LIMIT ?  [["goal_id", 1], ["LIMIT", 1]]
---
                  <!-- Progress Summary -->
                  <% if goal.goal_completions.any? %>