app/models/goal_completion.rb

INSERT INTO "goal_completions" ("goal_id", "week_start_date", "completed_count", "week_number", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def self.find_or_create_for_goal_and_week(goal, week_start_date)